base/ExchangePlans/бит_АудиторскаяВыгрузка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ExchangePlan>
		<Properties>
			<Name>бит_АудиторскаяВыгрузка</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериодаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФильтрРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСистемы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

base/ExchangePlans/бит_АудиторскаяВыгрузка/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДаннымиСервер.НадоВыполнитьОбработчикПослеЗагрузкиДанных(ЭтотОбъект, Ссылка) Тогда
		
		ПослеЗагрузкиДанных();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента)
	
	МетаданныеЭлемента  = ЭлементДанных.Метаданные();
	ПолноеИмяМетаданных = МетаданныеЭлемента.ПолноеИмя();
	
	Если НЕ бит_АудиторскаяВыгрузкаПовтИсп.ОбъектРазрешенДляВыгрузкиИзАудита(ПолноеИмяМетаданных) Тогда
		ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	МетаданныеЭлемента  = ЭлементДанных.Метаданные();
	ПолноеИмяМетаданных = МетаданныеЭлемента.ПолноеИмя();
	
	Если НЕ бит_АудиторскаяВыгрузкаПовтИсп.ОбъектРазрешенДляВыгрузкиИзАудита(ПолноеИмяМетаданных) Тогда
		ПолучениеЭлемента = ПолучениеЭлементаДанных.Игнорировать;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза)
	
	Если СозданиеНачальногоОбраза Тогда
		УзлыПолучатели = ОбменДаннымиСобытия.ОпределитьПолучателей(ЭлементДанных, "бит_АудиторскаяВыгрузка");
		Если УзлыПолучатели.Найти(Ссылка) = Неопределено Тогда
			ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	МетаданныеЭлемента  = ЭлементДанных.Метаданные();
	ПолноеИмяМетаданных = МетаданныеЭлемента.ПолноеИмя();
	
	ФильтрыРеквизитов = бит_АудиторскаяВыгрузкаПовтИсп.ФильтрыРеквизитовДляОбъектаМетаданных(Ссылка, ПолноеИмяМетаданных);
	
	ЭтоРегистр = Метаданные.РегистрыСведений.Содержит(МетаданныеЭлемента)
					ИЛИ Метаданные.РегистрыНакопления.Содержит(МетаданныеЭлемента)
					ИЛИ Метаданные.РегистрыБухгалтерии.Содержит(МетаданныеЭлемента);
					
	ПредопределенныйЭлемент = Ложь;
	Если Метаданные.Справочники.Содержит(МетаданныеЭлемента)
		ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеЭлемента)
		ИЛИ Метаданные.ПланыСчетов.Содержит(МетаданныеЭлемента)
		ИЛИ Метаданные.ПланыВидовРасчета.Содержит(МетаданныеЭлемента) Тогда
		ПредопределенныйЭлемент = ЭлементДанных.Предопределенный;
	КонецЕсли;
	
	Для каждого СтрокаФильтра Из ФильтрыРеквизитов Цикл
		ИмяТабличнойЧасти = СтрокаФильтра.ИмяТабличнойЧасти; 
		ИмяРеквизита      = СтрокаФильтра.ИмяРеквизита;
		Если СтрокаФильтра.ПолноеОграничение Тогда
			Если НЕ ПредопределенныйЭлемент Тогда
				ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
				Возврат;
			КонецЕсли;
		ИначеЕсли НЕ ПустаяСтрока(ИмяТабличнойЧасти) Тогда
			Для каждого СтрокаТабличнойЧасти Из ЭлементДанных[ИмяТабличнойЧасти] Цикл
				СтрокаТабличнойЧасти[ИмяРеквизита] = Неопределено;
			КонецЦикла;
		ИначеЕсли ЭтоРегистр Тогда
			Для каждого ЗаписьРегистра Из ЭлементДанных Цикл
				ЗаписьРегистра[ИмяРеквизита] = Неопределено;
			КонецЦикла;
		Иначе
			ЭлементДанных[ИмяРеквизита] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПослеЗагрузкиДанных()
	
	Если Ссылка <> ПланыОбмена.Полный.ЭтотУзел() Тогда
		
		// СтандартныеПодсистемы.ЗащитаПерсональныхДанных
		ЗащитаПерсональныхДанных.ПослеЗагрузкиДанных(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных
		
	КонецЕсли;
	
	Справочники.бит_КлючиСценарийЦФО.ЗаменитьДублиКлючейАналитики();
	Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.ЗаменитьДублиКлючейАналитики();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
